In [23]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings("ignore")

## First CSV actor names database

In [24]:
actor = pd.read_csv("data/actor.csv")

In [25]:
actor.shape

(200, 4)

In [26]:
actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [27]:
actor.info('deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 6.4+ KB

In [28]:
actor.last_update.value_counts()

2006-02-15 04:34:33    200
Name: last_update, dtype: int64

In [29]:
actor.drop('last_update', axis=1, inplace=True)

In [30]:
actor.head()

   actor_id first_name     last_name
0         1   PENELOPE       GUINESS
1         2       NICK      WAHLBERG
2         3         ED         CHASE
3         4   JENNIFER         DAVIS
4         5     JOHNNY  LOLLOBRIGIDA

In [31]:
actor["full_name"] = actor.first_name + " " + actor.last_name

In [32]:
actor.drop('first_name', axis=1, inplace=True)

In [33]:
actor.drop('last_name', axis=1, inplace=True)

In [34]:
actor.full_name.value_counts() #one duplicate

SUSAN DAVIS             2
EWAN GOODING            1
DARYL CRAWFORD          1
GRETA KEITEL            1
JANE JACKMAN            1
                       ..
MICHELLE MCCONAUGHEY    1
ADAM GRANT              1
SEAN WILLIAMS           1
GARY PENN               1
THORA TEMPLE            1
Name: full_name, Length: 199, dtype: int64

In [35]:
actor.drop(list(actor[actor.full_name=="SUSAN DAVIS"].index)[0], axis=0, inplace=True) #to drop

## Second CSV category database

In [36]:
category = pd.read_csv("data/category.csv")

In [37]:
category.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [38]:
category.shape

(16, 3)

In [39]:
category.info('deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 512.0+ bytes

In [40]:
category.drop('last_update', axis=1, inplace=True)

In [41]:
category.name.value_counts()

Action         1
Animation      1
Children       1
Classics       1
Comedy         1
Documentary    1
Drama          1
Family         1
Foreign        1
Games          1
Horror         1
Music          1
New            1
Sci-Fi         1
Sports         1
Travel         1
Name: name, dtype: int64

## Third CSV film database

In [42]:
film = pd.read_csv("data/film.csv")

In [43]:
film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [44]:
film.info('deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   release_year          1000 non-null   int64
 4   language_id           1000 non-null   int64
 5   original_language_id  0 non-null      float64
 6   rental_duration       1000 non-null   int64
 7   rental_rate           1000 non-null   float64
 8   length                1000 non-null   int64
 9   replacement_cost      1000 non-null   float64
 10  rating                1000 non-null   object
 11  special_features      1000 non-null   object
 12  last_update           1000 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 101.7+ KB

In [45]:
film.drop('original_language_id', axis=1, inplace=True)

In [46]:
film.release_year.value_counts()

2006    1000
Name: release_year, dtype: int64

In [47]:
film.drop('release_year', axis=1, inplace=True)

In [48]:
film.last_update.value_counts()

2006-02-15 05:03:42    1000
Name: last_update, dtype: int64

In [49]:
film.drop('last_update', axis=1, inplace=True)

In [50]:
film.info('deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int64
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   language_id       1000 non-null   int64
 4   rental_duration   1000 non-null   int64
 5   rental_rate       1000 non-null   float64
 6   length            1000 non-null   int64
 7   replacement_cost  1000 non-null   float64
 8   rating            1000 non-null   object
 9   special_features  1000 non-null   object
dtypes: float64(2), int64(4), object(4)
memory usage: 78.2+ KB

In [51]:
film.drop_duplicates(inplace=True) #no hay duplicados

In [52]:
film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,1,6,2.99,130,22.99,G,Deleted Scenes

In [53]:
description_list = []
for i in film.description:
    description_list.append(i[2:])

film.description = description_list

#description list had all values start with a capital a and a blank space

In [ ]:
film.title.value_counts()

## Fourth CSV film inventory

In [54]:
inventory = pd.read_csv("data/inventory.csv")

In [111]:
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1

In [56]:
inventory.info('deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
 3   last_update   1000 non-null   object
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [106]:
inventory.rental_id.value_counts()

AttributeError: 'DataFrame' object has no attribute 'rental_id'

In [58]:
inventory.drop('last_update', axis=1, inplace=True)

## Fifth CSV film old_HDD

In [59]:
old_HDD = pd.read_csv("data/old_HDD.csv")

In [91]:
old_HDD.head(40)

                    title  category_id         full_name
0        ACADEMY DINOSAUR            6  PENELOPE GUINESS
1    ANACONDA CONFESSIONS            2  PENELOPE GUINESS
2             ANGELS LIFE           13  PENELOPE GUINESS
3   BULWORTH COMMANDMENTS           10  PENELOPE GUINESS
4           CHEAPER CLYDE           14  PENELOPE GUINESS
5      COLOR PHILADELPHIA            4  PENELOPE GUINESS
6         ELEPHANT TROJAN           11  PENELOPE GUINESS
7     GLEAMING JAWBREAKER           15  PENELOPE GUINESS
8          HUMAN GRAFFITI           10  PENELOPE GUINESS
9          KING EVOLUTION            8  PENELOPE GUINESS
10             LADY STAGE           11  PENELOPE GUINESS
11        LANGUAGE COWBOY            3  PENELOPE GUINESS
12       MULHOLLAND BEAST            9  PENELOPE GUINESS
13       OKLAHOMA JUMANJI           13  PENELOPE GUINESS
14            RULES HUMAN           11  PENELOPE GUINESS
15            SPLASH GUMP            8  PENELOPE GUINESS
16      VERTIGO NORTHWEST            5  PENELOPE GUINESS
17    WESTWARD SEABISCUIT            4  PENELOPE GUINESS
18     WIZARD COLDBLOODED           12  PENELOPE GUINESS
19       ADAPTATION HOLES            6     NICK WAHLBERG
20          APACHE DIVINE            8     NICK WAHLBERG
21              BABY HALL            9     NICK WAHLBERG
22         BULL SHAWSHANK            1     NICK WAHLBERG
23        CHAINSAW UPTOWN           14     NICK WAHLBERG
24        CHISUM BEHAVIOR            8     NICK WAHLBERG
25       DESTINY SATURDAY           13     NICK WAHLBERG
26        DRACULA CRYSTAL            4     NICK WAHLBERG
27       FIGHT JAWBREAKER            2     NICK WAHLBERG
28             FLASH WARS           13     NICK WAHLBERG
29        GILBERT PELICAN            4     NICK WAHLBERG
30      GOODFELLAS SALUTE           14     NICK WAHLBERG
31       HAPPINESS UNITED            9     NICK WAHLBERG
32            INDIAN LOVE            8     NICK WAHLBERG
33         JEKYLL FROGMEN           13     NICK WAHLBERG
34           JERSEY SASSY            3     NICK WAHLBERG
35         LIAISONS SWEET           16     NICK WAHLBERG
36           LUCKY FLYING           12     NICK WAHLBERG
37         MAGUIRE APACHE            8     NICK WAHLBERG
38        MALLRATS UNITED            5     NICK WAHLBERG
39             MASK PEACH           13     NICK WAHLBERG

In [92]:
old_HDD.title.value_counts()

BOONDOCK BALLROOM     6
FLASH WARS            5
STRANGER STRANGERS    5
OKLAHOMA JUMANJI      5
CHITTY LOCK           5
                     ..
FLYING HOOK           1
EGYPT TENENBAUMS      1
BUTCH PANTHER         1
TYCOON GATHERING      1
EXORCIST STING        1
Name: title, Length: 614, dtype: int64

In [61]:
old_HDD.release_year.value_counts()

2006    1000
Name: release_year, dtype: int64

In [62]:
old_HDD.drop('release_year', axis=1, inplace=True)

In [63]:
old_HDD.drop_duplicates(inplace=True) #no hay duplicados

In [64]:
old_HDD.info('deep')

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   first_name   1000 non-null   object
 1   last_name    1000 non-null   object
 2   title        1000 non-null   object
 3   category_id  1000 non-null   int64
dtypes: int64(1), object(3)
memory usage: 39.1+ KB

In [65]:
old_HDD["full_name"] = old_HDD.first_name + " " + old_HDD.last_name

In [66]:
old_HDD.drop('first_name', axis=1, inplace=True)

In [67]:
old_HDD.drop('last_name', axis=1, inplace=True)

## Sixth CSV language

In [68]:
language = pd.read_csv("data/language.csv")

In [69]:
language.head()

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19

In [70]:
language.drop('last_update', axis=1, inplace=True)

## Seventh CSV rental

In [71]:
rental = pd.read_csv("data/rental.csv")

In [72]:
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [73]:
rental.drop('last_update', axis=1, inplace=True)

In [74]:
rental.rental_id.value_counts()

1       1
673     1
660     1
661     1
662     1
       ..
340     1
341     1
342     1
343     1
1001    1
Name: rental_id, Length: 1000, dtype: int64

In [94]:
inventory.inventory_id.value_counts()

1       1
672     1
659     1
660     1
661     1
       ..
339     1
340     1
341     1
342     1
1000    1
Name: inventory_id, Length: 1000, dtype: int64

## MySQL

In [75]:
from sqlalchemy import create_engine

In [76]:
str_conn='mysql+pymysql://root:cobyshon1@localhost:3306'

In [77]:
cursor=create_engine(str_conn)

In [ ]:
cursor.execute('create database videoclub')

In [78]:
str_conn='mysql+pymysql://root:cobyshon1@localhost:3306/videoclub'

In [79]:
cursor_sql=create_engine(str_conn)

In [ ]:
actor.to_sql(name='actors', index=False, con=cursor_sql)

In [80]:
category.to_sql(name='categories', index=False, con=cursor_sql)

16

In [82]:
film.to_sql(name='films', index=False, con=cursor_sql)

1000

In [83]:
inventory.to_sql(name='inventories', index=False, con=cursor_sql)

1000

In [84]:
language.to_sql(name='languages', index=False, con=cursor_sql)

6

In [86]:
old_HDD.to_sql(name='old_films', index=False, con=cursor_sql)

1000

In [87]:
rental.to_sql(name='rental', index=False, con=cursor_sql)

1000